
## Plan Result (terraform/cloudflare/b0xp.io/prometheus-operator)

[CI link](https://github.com/boxp/arch/actions/runs/12609365962)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_access_application.prometheus_web
  * cloudflare_access_policy.prometheus_web_policy
  * cloudflare_record.prometheus_web
* Update
  * cloudflare_tunnel_config.prometheus_operator_tunnel


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_access_application.prometheus_web will be created
  + resource "cloudflare_access_application" "prometheus_web" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = "prometheus-web.b0xp.io"
      + domain_type                  = (known after apply)
      + enable_binding_cookie        = false
      + id                           = (known after apply)
      + name                         = "Access application for prometheus-web.b0xp.io"
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.prometheus_web_policy will be created
  + resource "cloudflare_access_policy" "prometheus_web_policy" {
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for prometheus-web.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + login_method = [
              + "b9248b7d-c1fa-48ab-8a43-ebffe03fabac",
            ]
        }
    }

  # cloudflare_record.prometheus_web will be created
  + resource "cloudflare_record" "prometheus_web" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "prometheus-web"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "25190a02-f54f-4951-ac18-c98db4501fb4.cfargotunnel.com"
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel_config.prometheus_operator_tunnel will be updated in-place
  ~ resource "cloudflare_tunnel_config" "prometheus_operator_tunnel" {
        id         = "25190a02-f54f-4951-ac18-c98db4501fb4"
        # (2 unchanged attributes hidden)

      ~ config {
          ~ ingress_rule {
              + hostname = (known after apply)
              ~ service  = "http_status:404" -> "http://prometheus-k8s:9090"
            }
          + ingress_rule {
              + service = "http_status:404"
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_access_application.grafana,
  on access.tf line 2, in resource "cloudflare_access_application" "grafana":
   2: resource "cloudflare_access_application" "grafana" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 13 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.grafana,
  on dns.tf line 5, in resource "cloudflare_record" "grafana":
   5:   value   = cloudflare_tunnel.prometheus_operator_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Deprecated Resource

  with cloudflare_access_application.grafana,
  on access.tf line 2, in resource "cloudflare_access_application" "grafana":
   2: resource "cloudflare_access_application" "grafana" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 13 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.grafana,
  on dns.tf line 5, in resource "cloudflare_record" "grafana":
   5:   value   = cloudflare_tunnel.prometheus_operator_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and one more similar warning elsewhere)
```



## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/prometheus-operator/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/2632/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2632,"Program":"tfcmt","SHA1":"751bd998600ca0664c3a4a0f802d42b963795a96","Target":"terraform/cloudflare/b0xp.io/prometheus-operator","Vars":{},"WorkflowName":"pull_request_target"} -->